import React, {FC} from 'react';
import classes from "./header.module.scss";
import Select from "../mySelect/Select";
import { Link } from "react-router-dom";
import { useDispatch } from "react-redux";
import { useAppDispatch, useAppSelector } from '../../../hooks/redux';
import { authenticate } from '../../../store/reducers/authSlice';

const Header: FC = () => {
    const {isAuth} = useAppSelector(state => state.auth)
    const dispatch = useAppDispatch()
    const content:string[] = ["gang", "shemng", "bang"];
    return (
        <header className={classes.header}>
        <div className={classes.content}>
          <Link style={{ textDecoration: 'none' }} to="/home"><div className={classes.logo}>Brighter</div></Link>
          <div className={classes.selects}>
            <Select category="Женщинам" content={content} />
            <Select category="Мужчинам" content={content} />
            <Select category="Обувь" content={content} />
            <Select category="Интерьер" content={content} />
            <Select category="Кухня" content={content} />
          </div>
          <div className={classes.icons}>
            <svg
              className={classes.icon_heart}
              xmlns="http://www.w3.org/2000/svg"
              width="32"
              height="32"
              viewBox="0 0 32 32"
              fill="none"
            >
              <path
                d="M16 27C16 27 3.5 20 3.5 11.5C3.5 9.99737 4.02062 8.54114 4.97328 7.37908C5.92593 6.21703 7.25178 5.42093 8.72525 5.12624C10.1987 4.83154 11.7288 5.05646 13.0551 5.76272C14.3814 6.46898 15.4221 7.61296 16 9.00001C16.5779 7.61296 17.6186 6.46898 18.9449 5.76272C20.2712 5.05646 21.8013 4.83154 23.2748 5.12624C24.7482 5.42093 26.0741 6.21703 27.0267 7.37908C27.9794 8.54114 28.5 9.99737 28.5 11.5C28.5 20 16 27 16 27Z"
                strokeWidth="2"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
            </svg>
            <Link to={isAuth ? "/profile" : "/register"}><svg
              className={classes.icon}
              xmlns="http://www.w3.org/2000/svg"
              width="32"
              height="32"
              viewBox="0 0 32 32"
              fill="none"
            >
              <path d="M3.00893 26.5002C2.73283 26.9785 2.89676 27.5901 3.37508 27.8662C3.8534 28.1423 4.46497 27.9784 4.74107 27.5001L3.00893 26.5002ZM27.2589 27.5001C27.535 27.9784 28.1466 28.1423 28.6249 27.8662C29.1032 27.5901 29.2672 26.9785 28.9911 26.5002L27.2589 27.5001ZM23 12C23 15.866 19.866 19 16 19V21C20.9706 21 25 16.9706 25 12H23ZM16 19C12.134 19 9 15.866 9 12H7C7 16.9706 11.0294 21 16 21V19ZM9 12C9 8.13401 12.134 5 16 5V3C11.0294 3 7 7.02944 7 12H9ZM16 5C19.866 5 23 8.13401 23 12H25C25 7.02944 20.9706 3 16 3V5ZM4.74107 27.5001C5.88198 25.5235 7.52311 23.8822 9.49948 22.741L8.4994 21.009C6.21897 22.3257 4.32536 24.2196 3.00893 26.5002L4.74107 27.5001ZM9.49948 22.741C11.4756 21.5999 13.7176 21 16 21V19C13.367 19 10.7801 19.6921 8.4994 21.009L9.49948 22.741ZM16 21C18.2824 21 20.5244 21.5999 22.5005 22.741L23.5006 21.009C21.2199 19.6921 18.633 19 16 19V21ZM22.5005 22.741C24.4769 23.8822 26.118 25.5235 27.2589 27.5001L28.9911 26.5002C27.6746 24.2196 25.781 22.3257 23.5006 21.009L22.5005 22.741Z" />
            </svg></Link>
            <Link to={isAuth ? "/cart" : "/register"}> <svg
              className={classes.icon}
              xmlns="http://www.w3.org/2000/svg"
              width="32"
              height="32"
              viewBox="0 0 32 32"
              fill="none"
            >
              <path d="M5.2875 8C4.73522 8 4.2875 8.44772 4.2875 9C4.2875 9.55229 4.73522 10 5.2875 10V8ZM27.7125 9L28.674 9.27472C28.7602 8.973 28.6998 8.64832 28.5108 8.3978C28.3219 8.14729 28.0263 8 27.7125 8V9ZM24.4125 20.55L23.451 20.2753L23.4498 20.2796L24.4125 20.55ZM22.4875 22L22.4933 21H22.4875V22ZM10.5125 22V21L10.5067 21L10.5125 22ZM8.5875 20.55L9.55025 20.2796L9.54897 20.2751L8.5875 20.55ZM4.0625 4.725L5.02397 4.45008L5.02394 4.45L4.0625 4.725ZM3.1 4V5L3.10106 5L3.1 4ZM1 3C0.447715 3 0 3.44772 0 4C0 4.55229 0.447715 5 1 5V3ZM11 27C11 27.5523 10.5523 28 10 28V30C11.6569 30 13 28.6569 13 27H11ZM10 28C9.44771 28 9 27.5523 9 27H7C7 28.6569 8.34315 30 10 30V28ZM9 27C9 26.4477 9.44771 26 10 26V24C8.34315 24 7 25.3431 7 27H9ZM10 26C10.5523 26 11 26.4477 11 27H13C13 25.3431 11.6569 24 10 24V26ZM24 27C24 27.5523 23.5523 28 23 28V30C24.6569 30 26 28.6569 26 27H24ZM23 28C22.4477 28 22 27.5523 22 27H20C20 28.6569 21.3431 30 23 30V28ZM22 27C22 26.4477 22.4477 26 23 26V24C21.3431 24 20 25.3431 20 27H22ZM23 26C23.5523 26 24 26.4477 24 27H26C26 25.3431 24.6569 24 23 24V26ZM5.2875 10H27.7125V8H5.2875V10ZM26.751 8.72528L23.451 20.2753L25.374 20.8247L28.674 9.27472L26.751 8.72528ZM23.4498 20.2796C23.3913 20.4878 23.266 20.6711 23.0932 20.8013L24.2965 22.3988C24.8193 22.005 25.1983 21.4505 25.3752 20.8204L23.4498 20.2796ZM23.0932 20.8013C22.9204 20.9315 22.7096 21.0013 22.4933 21L22.4817 23C23.1361 23.0038 23.7737 22.7926 24.2965 22.3988L23.0932 20.8013ZM22.4875 21H10.5125V23H22.4875V21ZM10.5067 21C10.2904 21.0013 10.0796 20.9315 9.90681 20.8013L8.70349 22.3988C9.22625 22.7926 9.86385 23.0038 10.5183 23L10.5067 21ZM9.90681 20.8013C9.73402 20.6711 9.60874 20.4878 9.55024 20.2796L7.62476 20.8204C7.80174 21.4505 8.18074 22.005 8.70349 22.3988L9.90681 20.8013ZM9.54897 20.2751L5.02397 4.45008L3.10103 4.99992L7.62603 20.8249L9.54897 20.2751ZM5.02394 4.45C4.90435 4.03189 4.65174 3.66414 4.30437 3.40249L3.10106 5V5L5.02394 4.45ZM4.30437 3.40249C3.95701 3.14084 3.53383 2.99954 3.09894 3L3.10106 5V5L4.30437 3.40249ZM3.1 3H1V5H3.1V3Z" />
            </svg></Link>
            <button onClick={() => dispatch(authenticate(false))}>Logout</button>
          </div>
        </div>
        <div className={classes.search}>
  <svg xmlns="http://www.w3.org/2000/svg" width="33" height="32" viewBox="0 0 33 32" fill="none">
        <path d="M22.425 21.9248L28.5 27.9998M25.5 14.5C25.5 20.299 20.799 25 15 25C9.20101 25 4.5 20.299 4.5 14.5C4.5 8.70101 9.20101 4 15 4C20.799 4 25.5 8.70101 25.5 14.5Z" stroke="#2C2C2C" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
        </svg>
          <input placeholder="Поиск" />
        </div>
      </header>
);
};

export default Header